{
    "Arn": "arn:aws:cloudformation:us-east-1::type/resource/AWS-RDS-DBInstance",
    "Type": "RESOURCE",
    "TypeName": "AWS::RDS::DBInstance",
    "IsDefaultVersion": true,
    "Description": "The AWS::RDS::DBInstance resource creates an Amazon RDS DB instance.",
    "Schema": "{\n  \"typeName\": \"AWS::RDS::DBInstance\",\n  \"description\": \"The AWS::RDS::DBInstance resource creates an Amazon RDS DB instance.\",\n  \"sourceUrl\": \"https://github.com/aws-cloudformation/aws-cloudformation-rpdk.git\",\n  \"definitions\": {\n    \"CertificateDetails\": {\n      \"type\": \"object\",\n      \"additionalProperties\": false,\n      \"properties\": {\n        \"CAIdentifier\": {\n          \"type\": \"string\",\n          \"description\": \"The CA identifier of the CA certificate used for the DB instance's server certificate.\"\n        },\n        \"ValidTill\": {\n          \"type\": \"string\",\n          \"format\": \"date-time\",\n          \"description\": \"The expiration date of the DB instance\\u2019s server certificate.\"\n        }\n      }\n    },\n    \"Endpoint\": {\n      \"type\": \"object\",\n      \"additionalProperties\": false,\n      \"properties\": {\n        \"Address\": {\n          \"type\": \"string\",\n          \"description\": \"Specifies the DNS address of the DB instance.\"\n        },\n        \"Port\": {\n          \"type\": \"string\",\n          \"description\": \"Specifies the port that the database engine is listening on.\"\n        },\n        \"HostedZoneId\": {\n          \"type\": \"string\",\n          \"description\": \"Specifies the ID that Amazon Route 53 assigns when you create a hosted zone.\"\n        }\n      }\n    },\n    \"DBInstanceRole\": {\n      \"type\": \"object\",\n      \"additionalProperties\": false,\n      \"properties\": {\n        \"FeatureName\": {\n          \"type\": \"string\",\n          \"description\": \"The name of the feature associated with the AWS Identity and Access Management (IAM) role. IAM roles that are associated with a DB instance grant permission for the DB instance to access other AWS services on your behalf.\"\n        },\n        \"RoleArn\": {\n          \"type\": \"string\",\n          \"description\": \"The Amazon Resource Name (ARN) of the IAM role that is associated with the DB instance.\"\n        }\n      },\n      \"required\": [\n        \"FeatureName\",\n        \"RoleArn\"\n      ]\n    },\n    \"ProcessorFeature\": {\n      \"type\": \"object\",\n      \"additionalProperties\": false,\n      \"properties\": {\n        \"Name\": {\n          \"type\": \"string\",\n          \"enum\": [\n            \"coreCount\",\n            \"threadsPerCore\"\n          ],\n          \"description\": \"The name of the processor feature. Valid names are coreCount and threadsPerCore.\"\n        },\n        \"Value\": {\n          \"type\": \"string\",\n          \"description\": \"The value of a processor feature name.\"\n        }\n      }\n    },\n    \"Tag\": {\n      \"description\": \"A key-value pair to associate with a resource.\",\n      \"type\": \"object\",\n      \"additionalProperties\": false,\n      \"properties\": {\n        \"Key\": {\n          \"type\": \"string\",\n          \"description\": \"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. \",\n          \"minLength\": 1,\n          \"maxLength\": 128\n        },\n        \"Value\": {\n          \"type\": \"string\",\n          \"description\": \"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. \",\n          \"minLength\": 0,\n          \"maxLength\": 256\n        }\n      },\n      \"required\": [\n        \"Key\"\n      ]\n    },\n    \"MasterUserSecret\": {\n      \"type\": \"object\",\n      \"additionalProperties\": false,\n      \"properties\": {\n        \"SecretArn\": {\n          \"type\": \"string\",\n          \"description\": \"The Amazon Resource Name (ARN) of the secret.\"\n        },\n        \"KmsKeyId\": {\n          \"type\": \"string\",\n          \"description\": \"The AWS KMS key identifier that is used to encrypt the secret.\"\n        }\n      }\n    }\n  },\n  \"properties\": {\n    \"AllocatedStorage\": {\n      \"type\": \"string\",\n      \"description\": \"The amount of storage (in gigabytes) to be initially allocated for the database instance.\",\n      \"pattern\": \"^[0-9]*$\"\n    },\n    \"AllowMajorVersionUpgrade\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether major version upgrades are allowed. Changing this parameter doesn't result in an outage and the change is asynchronously applied as soon as possible.\"\n    },\n    \"AssociatedRoles\": {\n      \"type\": \"array\",\n      \"items\": {\n        \"$ref\": \"#/definitions/DBInstanceRole\"\n      },\n      \"description\": \"The AWS Identity and Access Management (IAM) roles associated with the DB instance.\"\n    },\n    \"AutoMinorVersionUpgrade\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether minor engine upgrades are applied automatically to the DB instance during the maintenance window. By default, minor engine upgrades are applied automatically.\"\n    },\n    \"AutomaticBackupReplicationRegion\": {\n      \"type\": \"string\",\n      \"description\": \"Enables replication of automated backups to a different Amazon Web Services Region.\"\n    },\n    \"AvailabilityZone\": {\n      \"type\": \"string\",\n      \"description\": \"The Availability Zone (AZ) where the database will be created. For information on AWS Regions and Availability Zones.\"\n    },\n    \"BackupRetentionPeriod\": {\n      \"type\": \"integer\",\n      \"minimum\": 0,\n      \"default\": 1,\n      \"description\": \"The number of days for which automated backups are retained. Setting this parameter to a positive number enables backups. Setting this parameter to 0 disables automated backups.\"\n    },\n    \"CACertificateIdentifier\": {\n      \"type\": \"string\",\n      \"description\": \"The identifier of the CA certificate for this DB instance.\"\n    },\n    \"CertificateDetails\": {\n      \"$ref\": \"#/definitions/CertificateDetails\",\n      \"description\": \"Returns the details of the DB instance's server certificate.\"\n    },\n    \"CertificateRotationRestart\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether the DB instance is restarted when you rotate your SSL/TLS certificate.\\nBy default, the DB instance is restarted when you rotate your SSL/TLS certificate. The certificate is not updated until the DB instance is restarted.\\nIf you are using SSL/TLS to connect to the DB instance, follow the appropriate instructions for your DB engine to rotate your SSL/TLS certificate\\nThis setting doesn't apply to RDS Custom.\"\n    },\n    \"CharacterSetName\": {\n      \"type\": \"string\",\n      \"description\": \"For supported engines, indicates that the DB instance should be associated with the specified character set.\"\n    },\n    \"CopyTagsToSnapshot\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether to copy tags from the DB instance to snapshots of the DB instance. By default, tags are not copied.\"\n    },\n    \"CustomIAMInstanceProfile\": {\n      \"type\": \"string\",\n      \"description\": \"The instance profile associated with the underlying Amazon EC2 instance of an RDS Custom DB instance. The instance profile must meet the following requirements:\\n * The profile must exist in your account.\\n * The profile must have an IAM role that Amazon EC2 has permissions to assume.\\n * The instance profile name and the associated IAM role name must start with the prefix AWSRDSCustom .\\nFor the list of permissions required for the IAM role, see Configure IAM and your VPC in the Amazon RDS User Guide .\\n\\nThis setting is required for RDS Custom.\"\n    },\n    \"DBClusterIdentifier\": {\n      \"type\": \"string\",\n      \"description\": \"The identifier of the DB cluster that the instance will belong to.\"\n    },\n    \"DBClusterSnapshotIdentifier\": {\n      \"type\": \"string\",\n      \"description\": \"The identifier for the RDS for MySQL Multi-AZ DB cluster snapshot to restore from. For more information on Multi-AZ DB clusters, see Multi-AZ deployments with two readable standby DB instances in the Amazon RDS User Guide .\\n\\nConstraints:\\n * Must match the identifier of an existing Multi-AZ DB cluster snapshot.\\n * Can't be specified when DBSnapshotIdentifier is specified.\\n * Must be specified when DBSnapshotIdentifier isn't specified.\\n * If you are restoring from a shared manual Multi-AZ DB cluster snapshot, the DBClusterSnapshotIdentifier must be the ARN of the shared snapshot.\\n * Can't be the identifier of an Aurora DB cluster snapshot.\\n * Can't be the identifier of an RDS for PostgreSQL Multi-AZ DB cluster snapshot.\"\n    },\n    \"DBInstanceArn\": {\n      \"type\": \"string\",\n      \"description\": \"The Amazon Resource Name (ARN) for the DB instance.\"\n    },\n    \"DBInstanceClass\": {\n      \"type\": \"string\",\n      \"description\": \"The compute and memory capacity of the DB instance, for example, db.m4.large. Not all DB instance classes are available in all AWS Regions, or for all database engines.\"\n    },\n    \"DBInstanceIdentifier\": {\n      \"type\": \"string\",\n      \"pattern\": \"^$|^[a-zA-Z]{1}(?:-?[a-zA-Z0-9]){0,62}$\",\n      \"minLength\": 1,\n      \"maxLength\": 63,\n      \"description\": \"A name for the DB instance. If you specify a name, AWS CloudFormation converts it to lowercase. If you don't specify a name, AWS CloudFormation generates a unique physical ID and uses that ID for the DB instance.\"\n    },\n    \"DbiResourceId\": {\n      \"type\": \"string\",\n      \"description\": \"The AWS Region-unique, immutable identifier for the DB instance. This identifier is found in AWS CloudTrail log entries whenever the AWS KMS key for the DB instance is accessed.\"\n    },\n    \"DBName\": {\n      \"type\": \"string\",\n      \"pattern\": \"^$|^[_a-zA-Z][a-zA-Z0-9_]{0,63}$\",\n      \"description\": \"The meaning of this parameter differs according to the database engine you use.\"\n    },\n    \"DBParameterGroupName\": {\n      \"type\": \"string\",\n      \"description\": \"The name of an existing DB parameter group or a reference to an AWS::RDS::DBParameterGroup resource created in the template.\"\n    },\n    \"DBSecurityGroups\": {\n      \"type\": \"array\",\n      \"uniqueItems\": true,\n      \"items\": {\n        \"type\": \"string\"\n      },\n      \"description\": \"A list of the DB security groups to assign to the DB instance. The list can include both the name of existing DB security groups or references to AWS::RDS::DBSecurityGroup resources created in the template.\"\n    },\n    \"DBSnapshotIdentifier\": {\n      \"type\": \"string\",\n      \"description\": \"The name or Amazon Resource Name (ARN) of the DB snapshot that's used to restore the DB instance. If you're restoring from a shared manual DB snapshot, you must specify the ARN of the snapshot.\"\n    },\n    \"DBSubnetGroupName\": {\n      \"type\": \"string\",\n      \"description\": \"A DB subnet group to associate with the DB instance. If you update this value, the new subnet group must be a subnet group in a new VPC.\"\n    },\n    \"DBSystemId\": {\n      \"type\": \"string\",\n      \"description\": \"The Oracle system ID (Oracle SID) for a container database (CDB). The Oracle SID is also the name of the CDB. This setting is valid for RDS Custom only.\"\n    },\n    \"DeleteAutomatedBackups\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether to remove automated backups immediately after the DB instance is deleted. This parameter isn't case-sensitive. The default is to remove automated backups immediately after the DB instance is deleted.\"\n    },\n    \"DeletionProtection\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether the DB instance has deletion protection enabled. The database can't be deleted when deletion protection is enabled. By default, deletion protection is disabled.\"\n    },\n    \"Domain\": {\n      \"type\": \"string\",\n      \"description\": \"The Active Directory directory ID to create the DB instance in. Currently, only MySQL, Microsoft SQL Server, Oracle, and PostgreSQL DB instances can be created in an Active Directory Domain.\"\n    },\n    \"DomainAuthSecretArn\": {\n      \"type\": \"string\",\n      \"description\": \"The ARN for the Secrets Manager secret with the credentials for the user joining the domain.\"\n    },\n    \"DomainDnsIps\": {\n      \"type\": \"array\",\n      \"items\": {\n        \"type\": \"string\"\n      },\n      \"description\": \"The IPv4 DNS IP addresses of your primary and secondary Active Directory domain controllers.\"\n    },\n    \"DomainFqdn\": {\n      \"type\": \"string\",\n      \"description\": \"The fully qualified domain name (FQDN) of an Active Directory domain.\"\n    },\n    \"DomainIAMRoleName\": {\n      \"type\": \"string\",\n      \"description\": \"Specify the name of the IAM role to be used when making API calls to the Directory Service.\"\n    },\n    \"DomainOu\": {\n      \"type\": \"string\",\n      \"description\": \"The Active Directory organizational unit for your DB instance to join.\"\n    },\n    \"EnableCloudwatchLogsExports\": {\n      \"type\": \"array\",\n      \"items\": {\n        \"type\": \"string\"\n      },\n      \"description\": \"The list of log types that need to be enabled for exporting to CloudWatch Logs. The values in the list depend on the DB engine being used.\"\n    },\n    \"EnableIAMDatabaseAuthentication\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether to enable mapping of AWS Identity and Access Management (IAM) accounts to database accounts. By default, mapping is disabled.\"\n    },\n    \"EnablePerformanceInsights\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether to enable Performance Insights for the DB instance.\"\n    },\n    \"Endpoint\": {\n      \"$ref\": \"#/definitions/Endpoint\",\n      \"description\": \"Specifies the connection endpoint.\"\n    },\n    \"Engine\": {\n      \"type\": \"string\",\n      \"description\": \"The name of the database engine that you want to use for this DB instance.\"\n    },\n    \"EngineVersion\": {\n      \"type\": \"string\",\n      \"description\": \"The version number of the database engine to use.\"\n    },\n    \"ManageMasterUserPassword\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether to manage the master user password with AWS Secrets Manager.\"\n    },\n    \"Iops\": {\n      \"type\": \"integer\",\n      \"description\": \"The number of I/O operations per second (IOPS) that the database provisions.\"\n    },\n    \"KmsKeyId\": {\n      \"type\": \"string\",\n      \"description\": \"The ARN of the AWS Key Management Service (AWS KMS) master key that's used to encrypt the DB instance.\"\n    },\n    \"LicenseModel\": {\n      \"type\": \"string\",\n      \"description\": \"License model information for this DB instance.\"\n    },\n    \"MasterUsername\": {\n      \"type\": \"string\",\n      \"pattern\": \"^[a-zA-Z][a-zA-Z0-9_]{0,127}$\",\n      \"description\": \"The master user name for the DB instance.\",\n      \"minLength\": 1,\n      \"maxLength\": 128\n    },\n    \"MasterUserPassword\": {\n      \"type\": \"string\",\n      \"description\": \"The password for the master user.\"\n    },\n    \"MasterUserSecret\": {\n      \"$ref\": \"#/definitions/MasterUserSecret\",\n      \"description\": \"Contains the secret managed by RDS in AWS Secrets Manager for the master user password.\"\n    },\n    \"MaxAllocatedStorage\": {\n      \"type\": \"integer\",\n      \"description\": \"The upper limit to which Amazon RDS can automatically scale the storage of the DB instance.\"\n    },\n    \"MonitoringInterval\": {\n      \"type\": \"integer\",\n      \"default\": 0,\n      \"description\": \"The interval, in seconds, between points when Enhanced Monitoring metrics are collected for the DB instance. To disable collecting Enhanced Monitoring metrics, specify 0. The default is 0.\"\n    },\n    \"MonitoringRoleArn\": {\n      \"type\": \"string\",\n      \"description\": \"The ARN for the IAM role that permits RDS to send enhanced monitoring metrics to Amazon CloudWatch Logs.\"\n    },\n    \"MultiAZ\": {\n      \"type\": \"boolean\",\n      \"description\": \"Specifies whether the database instance is a multiple Availability Zone deployment.\"\n    },\n    \"NcharCharacterSetName\": {\n      \"type\": \"string\",\n      \"description\": \"The name of the NCHAR character set for the Oracle DB instance. This parameter doesn't apply to RDS Custom.\"\n    },\n    \"NetworkType\": {\n      \"description\": \"The network type of the DB cluster.\",\n      \"type\": \"string\"\n    },\n    \"OptionGroupName\": {\n      \"type\": \"string\",\n      \"description\": \"Indicates that the DB instance should be associated with the specified option group.\"\n    },\n    \"PerformanceInsightsKMSKeyId\": {\n      \"type\": \"string\",\n      \"description\": \"The AWS KMS key identifier for encryption of Performance Insights data. The KMS key ID is the Amazon Resource Name (ARN), KMS key identifier, or the KMS key alias for the KMS encryption key.\"\n    },\n    \"PerformanceInsightsRetentionPeriod\": {\n      \"type\": \"integer\",\n      \"description\": \"The amount of time, in days, to retain Performance Insights data. Valid values are 7 or 731 (2 years).\"\n    },\n    \"Port\": {\n      \"type\": \"string\",\n      \"description\": \"The port number on which the database accepts connections.\",\n      \"pattern\": \"^\\\\d*$\"\n    },\n    \"PreferredBackupWindow\": {\n      \"type\": \"string\",\n      \"description\": \"The daily time range during which automated backups are created if automated backups are enabled, using the BackupRetentionPeriod parameter.\"\n    },\n    \"PreferredMaintenanceWindow\": {\n      \"type\": \"string\",\n      \"description\": \"he weekly time range during which system maintenance can occur, in Universal Coordinated Time (UTC).\"\n    },\n    \"ProcessorFeatures\": {\n      \"type\": \"array\",\n      \"items\": {\n        \"$ref\": \"#/definitions/ProcessorFeature\"\n      },\n      \"description\": \"The number of CPU cores and the number of threads per core for the DB instance class of the DB instance.\"\n    },\n    \"PromotionTier\": {\n      \"type\": \"integer\",\n      \"minimum\": 0,\n      \"default\": 1,\n      \"description\": \"A value that specifies the order in which an Aurora Replica is promoted to the primary instance after a failure of the existing primary instance.\"\n    },\n    \"PubliclyAccessible\": {\n      \"type\": \"boolean\",\n      \"description\": \"Indicates whether the DB instance is an internet-facing instance. If you specify true, AWS CloudFormation creates an instance with a publicly resolvable DNS name, which resolves to a public IP address. If you specify false, AWS CloudFormation creates an internal instance with a DNS name that resolves to a private IP address.\"\n    },\n    \"ReplicaMode\": {\n      \"description\": \"The open mode of an Oracle read replica. The default is open-read-only.\",\n      \"type\": \"string\"\n    },\n    \"RestoreTime\": {\n      \"description\": \"The date and time to restore from.\",\n      \"type\": \"string\",\n      \"format\": \"date-time\"\n    },\n    \"SourceDBClusterIdentifier\": {\n      \"description\": \"The identifier of the Multi-AZ DB cluster that will act as the source for the read replica. Each DB cluster can have up to 15 read replicas.\",\n      \"type\": \"string\"\n    },\n    \"SourceDbiResourceId\": {\n      \"type\": \"string\",\n      \"description\": \"The resource ID of the source DB instance from which to restore.\"\n    },\n    \"SourceDBInstanceAutomatedBackupsArn\": {\n      \"type\": \"string\",\n      \"description\": \"The Amazon Resource Name (ARN) of the replicated automated backups from which to restore.\"\n    },\n    \"SourceDBInstanceIdentifier\": {\n      \"type\": \"string\",\n      \"description\": \"If you want to create a Read Replica DB instance, specify the ID of the source DB instance. Each DB instance can have a limited number of Read Replicas.\"\n    },\n    \"SourceRegion\": {\n      \"type\": \"string\",\n      \"description\": \"The ID of the region that contains the source DB instance for the Read Replica.\"\n    },\n    \"StorageEncrypted\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether the DB instance is encrypted. By default, it isn't encrypted.\"\n    },\n    \"StorageType\": {\n      \"type\": \"string\",\n      \"description\": \"Specifies the storage type to be associated with the DB instance.\"\n    },\n    \"StorageThroughput\": {\n      \"type\": \"integer\",\n      \"description\": \"Specifies the storage throughput for the DB instance.\"\n    },\n    \"Tags\": {\n      \"type\": \"array\",\n      \"insertionOrder\": false,\n      \"uniqueItems\": false,\n      \"items\": {\n        \"$ref\": \"#/definitions/Tag\"\n      },\n      \"description\": \"Tags to assign to the DB instance.\"\n    },\n    \"TdeCredentialArn\": {\n      \"type\": \"string\",\n      \"description\": \"The ARN from the key store with which to associate the instance for TDE encryption.\"\n    },\n    \"TdeCredentialPassword\": {\n      \"type\": \"string\",\n      \"description\": \"The password for the given ARN from the key store in order to access the device.\"\n    },\n    \"Timezone\": {\n      \"type\": \"string\",\n      \"description\": \"The time zone of the DB instance. The time zone parameter is currently supported only by Microsoft SQL Server.\"\n    },\n    \"UseDefaultProcessorFeatures\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether the DB instance class of the DB instance uses its default processor features.\"\n    },\n    \"UseLatestRestorableTime\": {\n      \"type\": \"boolean\",\n      \"description\": \"A value that indicates whether the DB instance is restored from the latest backup time. By default, the DB instance isn't restored from the latest backup time.\"\n    },\n    \"VPCSecurityGroups\": {\n      \"type\": \"array\",\n      \"uniqueItems\": true,\n      \"items\": {\n        \"type\": \"string\"\n      },\n      \"description\": \"A list of the VPC security group IDs to assign to the DB instance. The list can include both the physical IDs of existing VPC security groups and references to AWS::EC2::SecurityGroup resources created in the template.\"\n    }\n  },\n  \"additionalProperties\": false,\n  \"propertyTransform\": {\n    \"/properties/DBClusterIdentifier\": \"$lowercase(DBClusterIdentifier)\",\n    \"/properties/DBClusterSnapshotIdentifier\": \"$lowercase(DBClusterSnapshotIdentifier)\",\n    \"/properties/DBInstanceIdentifier\": \"$lowercase(DBInstanceIdentifier)\",\n    \"/properties/DBName\": \"$lowercase(DBName) $OR $uppercase(DBName)\",\n    \"/properties/DBParameterGroupName\": \"$lowercase(DBParameterGroupName)\",\n    \"/properties/DBSnapshotIdentifier\": \"$lowercase(DBSnapshotIdentifier)\",\n    \"/properties/DBSubnetGroupName\": \"$lowercase(DBSubnetGroupName)\",\n    \"/properties/Engine\": \"$lowercase(Engine)\",\n    \"/properties/EngineVersion\": \"$join([$string(EngineVersion), \\\".*\\\"])\",\n    \"/properties/KmsKeyId\": \"$join([\\\"arn:(aws)[-]{0,1}[a-z]{0,2}[-]{0,1}[a-z]{0,3}:kms:[a-z]{2}[-]{1}[a-z]{3,10}[-]{0,1}[a-z]{0,10}[-]{1}[1-3]{1}:[0-9]{12}[:]{1}key\\\\/\\\", KmsKeyId])\",\n    \"/properties/MasterUserSecret/KmsKeyId\": \"$join([\\\"arn:(aws)[-]{0,1}[a-z]{0,2}[-]{0,1}[a-z]{0,3}:kms:[a-z]{2}[-]{1}[a-z]{3,10}[-]{0,1}[a-z]{0,10}[-]{1}[1-3]{1}:[0-9]{12}[:]{1}key\\\\/\\\", MasterUserSecret.KmsKeyId])\",\n    \"/properties/NetworkType\": \"$lowercase(NetworkType)\",\n    \"/properties/OptionGroupName\": \"$lowercase(OptionGroupName)\",\n    \"/properties/PerformanceInsightsKMSKeyId\": \"$join([\\\"arn:(aws)[-]{0,1}[a-z]{0,2}[-]{0,1}[a-z]{0,3}:kms:[a-z]{2}[-]{1}[a-z]{3,10}[-]{0,1}[a-z]{0,10}[-]{1}[1-3]{1}:[0-9]{12}[:]{1}key\\\\/\\\", PerformanceInsightsKMSKeyId])\",\n    \"/properties/PreferredMaintenanceWindow\": \"$lowercase(PreferredMaintenanceWindow)\",\n    \"/properties/SourceDBInstanceAutomatedBackupsArn\": \"$lowercase(SourceDBInstanceAutomatedBackupsArn)\",\n    \"/properties/SourceDBInstanceIdentifier\": \"$lowercase(SourceDBInstanceIdentifier)\",\n    \"/properties/StorageType\": \"$lowercase(StorageType)\"\n  },\n  \"createOnlyProperties\": [\n    \"/properties/CharacterSetName\",\n    \"/properties/CustomIAMInstanceProfile\",\n    \"/properties/DBClusterIdentifier\",\n    \"/properties/DBInstanceIdentifier\",\n    \"/properties/DBName\",\n    \"/properties/DBSubnetGroupName\",\n    \"/properties/KmsKeyId\",\n    \"/properties/MasterUsername\",\n    \"/properties/NcharCharacterSetName\",\n    \"/properties/Port\",\n    \"/properties/SourceRegion\",\n    \"/properties/StorageEncrypted\",\n    \"/properties/Timezone\"\n  ],\n  \"conditionalCreateOnlyProperties\": [\n    \"/properties/AutoMinorVersionUpgrade\",\n    \"/properties/AvailabilityZone\",\n    \"/properties/BackupRetentionPeriod\",\n    \"/properties/DBClusterSnapshotIdentifier\",\n    \"/properties/DBParameterGroupName\",\n    \"/properties/DBSnapshotIdentifier\",\n    \"/properties/Engine\",\n    \"/properties/MultiAZ\",\n    \"/properties/PerformanceInsightsKMSKeyId\",\n    \"/properties/PreferredMaintenanceWindow\",\n    \"/properties/RestoreTime\",\n    \"/properties/SourceDBClusterIdentifier\",\n    \"/properties/SourceDBInstanceAutomatedBackupsArn\",\n    \"/properties/SourceDBInstanceIdentifier\",\n    \"/properties/SourceDbiResourceId\",\n    \"/properties/StorageType\",\n    \"/properties/UseLatestRestorableTime\"\n  ],\n  \"deprecatedProperties\": [\n    \"/properties/TdeCredentialArn\",\n    \"/properties/TdeCredentialPassword\"\n  ],\n  \"writeOnlyProperties\": [\n    \"/properties/AllowMajorVersionUpgrade\",\n    \"/properties/CertificateRotationRestart\",\n    \"/properties/DBSnapshotIdentifier\",\n    \"/properties/DeleteAutomatedBackups\",\n    \"/properties/MasterUserPassword\",\n    \"/properties/Port\",\n    \"/properties/RestoreTime\",\n    \"/properties/SourceDBInstanceAutomatedBackupsArn\",\n    \"/properties/SourceDBInstanceIdentifier\",\n    \"/properties/SourceDbiResourceId\",\n    \"/properties/SourceRegion\",\n    \"/properties/TdeCredentialPassword\",\n    \"/properties/UseDefaultProcessorFeatures\",\n    \"/properties/UseLatestRestorableTime\"\n  ],\n  \"readOnlyProperties\": [\n    \"/properties/Endpoint/Address\",\n    \"/properties/Endpoint/Port\",\n    \"/properties/Endpoint/HostedZoneId\",\n    \"/properties/DbiResourceId\",\n    \"/properties/DBInstanceArn\",\n    \"/properties/DBSystemId\",\n    \"/properties/MasterUserSecret/SecretArn\",\n    \"/properties/CertificateDetails/CAIdentifier\",\n    \"/properties/CertificateDetails/ValidTill\"\n  ],\n  \"primaryIdentifier\": [\n    \"/properties/DBInstanceIdentifier\"\n  ],\n  \"handlers\": {\n    \"create\": {\n      \"permissions\": [\n        \"ec2:DescribeAccountAttributes\",\n        \"ec2:DescribeAvailabilityZones\",\n        \"ec2:DescribeInternetGateways\",\n        \"ec2:DescribeSecurityGroups\",\n        \"ec2:DescribeSubnets\",\n        \"ec2:DescribeVpcAttribute\",\n        \"ec2:DescribeVpcs\",\n        \"iam:CreateServiceLinkedRole\",\n        \"iam:GetRole\",\n        \"iam:ListRoles\",\n        \"iam:PassRole\",\n        \"kms:CreateGrant\",\n        \"kms:DescribeKey\",\n        \"rds:AddRoleToDBInstance\",\n        \"rds:AddTagsToResource\",\n        \"rds:CreateDBInstance\",\n        \"rds:CreateDBInstanceReadReplica\",\n        \"rds:DescribeDBInstances\",\n        \"rds:DescribeDBClusters\",\n        \"rds:DescribeDBClusterSnapshots\",\n        \"rds:DescribeDBInstanceAutomatedBackups\",\n        \"rds:DescribeDBSnapshots\",\n        \"rds:DescribeEvents\",\n        \"rds:ModifyDBInstance\",\n        \"rds:RebootDBInstance\",\n        \"rds:RestoreDBInstanceFromDBSnapshot\",\n        \"rds:RestoreDBInstanceToPointInTime\",\n        \"rds:StartDBInstanceAutomatedBackupsReplication\",\n        \"secretsmanager:CreateSecret\",\n        \"secretsmanager:TagResource\"\n      ],\n      \"timeoutInMinutes\": 2160\n    },\n    \"read\": {\n      \"permissions\": [\n        \"ec2:DescribeAccountAttributes\",\n        \"ec2:DescribeAvailabilityZones\",\n        \"ec2:DescribeInternetGateways\",\n        \"ec2:DescribeSecurityGroups\",\n        \"ec2:DescribeSubnets\",\n        \"ec2:DescribeVpcAttribute\",\n        \"ec2:DescribeVpcs\",\n        \"rds:DescribeDBInstances\"\n      ]\n    },\n    \"update\": {\n      \"permissions\": [\n        \"ec2:DescribeAccountAttributes\",\n        \"ec2:DescribeAvailabilityZones\",\n        \"ec2:DescribeInternetGateways\",\n        \"ec2:DescribeSecurityGroups\",\n        \"ec2:DescribeSubnets\",\n        \"ec2:DescribeVpcAttribute\",\n        \"ec2:DescribeVpcs\",\n        \"iam:CreateServiceLinkedRole\",\n        \"iam:GetRole\",\n        \"iam:ListRoles\",\n        \"iam:PassRole\",\n        \"kms:CreateGrant\",\n        \"kms:DescribeKey\",\n        \"rds:AddRoleToDBInstance\",\n        \"rds:AddTagsToResource\",\n        \"rds:DescribeDBClusters\",\n        \"rds:DescribeDBEngineVersions\",\n        \"rds:DescribeDBInstances\",\n        \"rds:DescribeDBParameterGroups\",\n        \"rds:DescribeEvents\",\n        \"rds:ModifyDBInstance\",\n        \"rds:PromoteReadReplica\",\n        \"rds:RebootDBInstance\",\n        \"rds:RemoveRoleFromDBInstance\",\n        \"rds:RemoveTagsFromResource\",\n        \"rds:StartDBInstanceAutomatedBackupsReplication\",\n        \"rds:StopDBInstanceAutomatedBackupsReplication\",\n        \"secretsmanager:CreateSecret\",\n        \"secretsmanager:TagResource\"\n      ],\n      \"timeoutInMinutes\": 2160\n    },\n    \"delete\": {\n      \"permissions\": [\n        \"rds:DeleteDBInstance\",\n        \"rds:DescribeDBInstances\"\n      ],\n      \"timeoutInMinutes\": 2160\n    },\n    \"list\": {\n      \"permissions\": [\n        \"rds:DescribeDBInstances\"\n      ]\n    }\n  }\n}\n",
    "ProvisioningType": "FULLY_MUTABLE",
    "DeprecatedStatus": "LIVE",
    "Visibility": "PUBLIC",
    "SourceUrl": "https://github.com/aws-cloudformation/aws-cloudformation-rpdk.git",
    "TimeCreated": "2021-11-10T21:16:41.842000+00:00"
}
